In [82]:

#import labraries
import pandas as pd
df = pd.read_csv(r"C:\Internship project\Mall_Customers.csv")
df

     CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
0             1    Male   19                  15                      39
1             2    Male   21                  15                      81
2             3  Female   20                  16                       6
3             4  Female   23                  16                      77
4             5  Female   31                  17                      40
..          ...     ...  ...                 ...                     ...
195         196  Female   35                 120                      79
196         197  Female   45                 126                      28
197         198    Male   32                 126                      74
198         199    Male   32                 137                      18
199         200    Male   30                 137                      83

[200 rows x 5 columns]

In [84]:
df.size

1000

In [86]:
df.shape

(200, 5)

In [88]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   CustomerID              200 non-null    int64
 1   Gender                  200 non-null    object
 2   Age                     200 non-null    int64
 3   Annual Income (k$)      200 non-null    int64
 4   Spending Score (1-100)  200 non-null    int64
dtypes: int64(4), object(1)
memory usage: 7.9+ KB

In [90]:
# 1. Check for missing values
print("\nMissing Values:\n")
print(df.isnull().sum())

Missing Values:

CustomerID                0
Gender                    0
Age                       0
Annual Income (k$)        0
Spending Score (1-100)    0
dtype: int64

In [92]:
# 2. Remove duplicate rows (if any)
df_before = df.shape[0]
df = df.drop_duplicates()
df_after = df.shape[0]
print(f"\nDuplicate Rows Removed: {df_before - df_after}")

Duplicate Rows Removed: 0

In [94]:
# 3. Standardize column names (lowercase & underscores)
df.columns = df.columns.str.strip().str.lower().str.replace(' ', '_')
print("\nStandardized Column Names:")
print(df.columns)

Standardized Column Names:
Index(['customerid', 'gender', 'age', 'annual_income_(k$)',
       'spending_score_(1-100)'],
      dtype='object')

In [96]:
# 4. Check and convert data types
print("\nData Types Before:")
print(df.dtypes)

# Rename columns for clarity (optional)
df.rename(columns={
    'annual_income_(k$)': 'annual_income_k',
    'spending_score_(1-100)': 'spending_score'
}, inplace=True)

# Convert object columns like gender to lowercase for consistency
df['gender'] = df['gender'].str.lower()

Data Types Before:
customerid                 int64
gender                    object
age                        int64
annual_income_(k$)         int64
spending_score_(1-100)     int64
dtype: object

In [98]:
# 5. Summary of cleaned data
print("\nData Types After:")
print(df.dtypes)

Data Types After:
customerid          int64
gender             object
age                 int64
annual_income_k     int64
spending_score      int64
dtype: object

In [100]:
# 6. Final cleaned data preview
print("\nCleaned Dataset Preview:")
print(df.head())

Cleaned Dataset Preview:
   customerid  gender  age  annual_income_k  spending_score
0           1    male   19               15              39
1           2    male   21               15              81
2           3  female   20               16               6
3           4  female   23               16              77
4           5  female   31               17              40

In [102]:
# 7. Save the cleaned dataset
df.to_csv("Mall_Customers_Cleaned.csv", index=False)
print("\nâœ… Cleaned dataset saved as 'Mall_Customers_Cleaned.csv'")

âœ… Cleaned dataset saved as 'Mall_Customers_Cleaned.csv'